cases/circular_Re150/coarse/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// Optimized circular cylinder blockMeshDict
// Domain: x[-20,40], y[-25,25], z[-0.05,0.05]
// Cylinder: R=0.5, D=1.0, center=(0,0)
// O-grid: R_outer=2.0, 633 circumferential, 135 radial
// Wall first cell: 0.005D, cell-to-cell: 2.1%
// Boundary match: 0.995x, all transitions smooth
// Total cells: ~271597 (refined x1.414)

scale 1.0;

vertices
(
    (-20 -25 -0.05)  // 0
    (-2 -25 -0.05)  // 1
    (0 -25 -0.05)  // 2
    (2 -25 -0.05)  // 3
    (10 -25 -0.05)  // 4
    (20 -25 -0.05)  // 5
    (40 -25 -0.05)  // 6
    (-20 -6 -0.05)  // 7
    (-2 -6 -0.05)  // 8
    (0 -6 -0.05)  // 9
    (2 -6 -0.05)  // 10
    (10 -6 -0.05)  // 11
    (20 -6 -0.05)  // 12
    (40 -6 -0.05)  // 13
    (-20 -2 -0.05)  // 14
    (-2 -2 -0.05)  // 15
    (0 -2 -0.05)  // 16
    (2 -2 -0.05)  // 17
    (10 -2 -0.05)  // 18
    (20 -2 -0.05)  // 19
    (40 -2 -0.05)  // 20
    (-20 0 -0.05)  // 21
    (-2 0 -0.05)  // 22
    (0 0 -0.05)  // 23
    (2 0 -0.05)  // 24
    (10 0 -0.05)  // 25
    (20 0 -0.05)  // 26
    (40 0 -0.05)  // 27
    (-20 2 -0.05)  // 28
    (-2 2 -0.05)  // 29
    (0 2 -0.05)  // 30
    (2 2 -0.05)  // 31
    (10 2 -0.05)  // 32
    (20 2 -0.05)  // 33
    (40 2 -0.05)  // 34
    (-20 6 -0.05)  // 35
    (-2 6 -0.05)  // 36
    (0 6 -0.05)  // 37
    (2 6 -0.05)  // 38
    (10 6 -0.05)  // 39
    (20 6 -0.05)  // 40
    (40 6 -0.05)  // 41
    (-20 25 -0.05)  // 42
    (-2 25 -0.05)  // 43
    (0 25 -0.05)  // 44
    (2 25 -0.05)  // 45
    (10 25 -0.05)  // 46
    (20 25 -0.05)  // 47
    (40 25 -0.05)  // 48
    (-20 -25 0.05)  // 49
    (-2 -25 0.05)  // 50
    (0 -25 0.05)  // 51
    (2 -25 0.05)  // 52
    (10 -25 0.05)  // 53
    (20 -25 0.05)  // 54
    (40 -25 0.05)  // 55
    (-20 -6 0.05)  // 56
    (-2 -6 0.05)  // 57
    (0 -6 0.05)  // 58
    (2 -6 0.05)  // 59
    (10 -6 0.05)  // 60
    (20 -6 0.05)  // 61
    (40 -6 0.05)  // 62
    (-20 -2 0.05)  // 63
    (-2 -2 0.05)  // 64
    (0 -2 0.05)  // 65
    (2 -2 0.05)  // 66
    (10 -2 0.05)  // 67
    (20 -2 0.05)  // 68
    (40 -2 0.05)  // 69
    (-20 0 0.05)  // 70
    (-2 0 0.05)  // 71
    (0 0 0.05)  // 72
    (2 0 0.05)  // 73
    (10 0 0.05)  // 74
    (20 0 0.05)  // 75
    (40 0 0.05)  // 76
    (-20 2 0.05)  // 77
    (-2 2 0.05)  // 78
    (0 2 0.05)  // 79
    (2 2 0.05)  // 80
    (10 2 0.05)  // 81
    (20 2 0.05)  // 82
    (40 2 0.05)  // 83
    (-20 6 0.05)  // 84
    (-2 6 0.05)  // 85
    (0 6 0.05)  // 86
    (2 6 0.05)  // 87
    (10 6 0.05)  // 88
    (20 6 0.05)  // 89
    (40 6 0.05)  // 90
    (-20 25 0.05)  // 91
    (-2 25 0.05)  // 92
    (0 25 0.05)  // 93
    (2 25 0.05)  // 94
    (10 25 0.05)  // 95
    (20 25 0.05)  // 96
    (40 25 0.05)  // 97
    (0 -0.5 -0.05)  // 98
    (0.353553 -0.353553 -0.05)  // 99
    (0.5 0 -0.05)  // 100
    (0.353553 0.353553 -0.05)  // 101
    (0 0.5 -0.05)  // 102
    (-0.353553 0.353553 -0.05)  // 103
    (-0.5 0 -0.05)  // 104
    (-0.353553 -0.353553 -0.05)  // 105
    (0 -0.5 0.05)  // 106
    (0.353553 -0.353553 0.05)  // 107
    (0.5 0 0.05)  // 108
    (0.353553 0.353553 0.05)  // 109
    (0 0.5 0.05)  // 110
    (-0.353553 0.353553 0.05)  // 111
    (-0.5 0 0.05)  // 112
    (-0.353553 -0.353553 0.05)  // 113
);

blocks
(
    hex (0 1 8 7 49 50 57 56) (17 14 1) simpleGrading (0.0257378 0.127107 1)
    hex (1 2 9 8 50 51 58 57) (20 14 1) simpleGrading (1 0.127107 1)
    hex (2 3 10 9 51 52 59 58) (20 14 1) simpleGrading (1 0.127107 1)
    hex (3 4 11 10 52 53 60 59) (42 14 1) simpleGrading (3.14909 0.127107 1)
    hex (4 5 12 11 53 54 61 60) (16 14 1) simpleGrading (3.58238 0.127107 1)
    hex (5 6 13 12 54 55 62 61) (11 14 1) simpleGrading (2.28625 0.127107 1)
    hex (7 8 15 14 56 57 64 63) (17 18 1) simpleGrading (0.0257378 0.251311 1)
    hex (8 9 16 15 57 58 65 64) (20 18 1) simpleGrading (1 0.251311 1)
    hex (9 10 17 16 58 59 66 65) (20 18 1) simpleGrading (1 0.251311 1)
    hex (10 11 18 17 59 60 67 66) (42 18 1) simpleGrading (3.14909 0.251311 1)
    hex (11 12 19 18 60 61 68 67) (16 18 1) simpleGrading (3.58238 0.251311 1)
    hex (12 13 20 19 61 62 69 68) (11 18 1) simpleGrading (2.28625 0.251311 1)
    hex (14 15 22 21 63 64 71 70) (17 20 1) simpleGrading (0.0257378 1 1)
    hex (17 18 25 24 66 67 74 73) (42 20 1) simpleGrading (3.14909 1 1)
    hex (18 19 26 25 67 68 75 74) (16 20 1) simpleGrading (3.58238 1 1)
    hex (19 20 27 26 68 69 76 75) (11 20 1) simpleGrading (2.28625 1 1)
    hex (21 22 29 28 70 71 78 77) (17 20 1) simpleGrading (0.0257378 1 1)
    hex (24 25 32 31 73 74 81 80) (42 20 1) simpleGrading (3.14909 1 1)
    hex (25 26 33 32 74 75 82 81) (16 20 1) simpleGrading (3.58238 1 1)
    hex (26 27 34 33 75 76 83 82) (11 20 1) simpleGrading (2.28625 1 1)
    hex (28 29 36 35 77 78 85 84) (17 18 1) simpleGrading (0.0257378 3.97914 1)
    hex (29 30 37 36 78 79 86 85) (20 18 1) simpleGrading (1 3.97914 1)
    hex (30 31 38 37 79 80 87 86) (20 18 1) simpleGrading (1 3.97914 1)
    hex (31 32 39 38 80 81 88 87) (42 18 1) simpleGrading (3.14909 3.97914 1)
    hex (32 33 40 39 81 82 89 88) (16 18 1) simpleGrading (3.58238 3.97914 1)
    hex (33 34 41 40 82 83 90 89) (11 18 1) simpleGrading (2.28625 3.97914 1)
    hex (35 36 43 42 84 85 92 91) (17 14 1) simpleGrading (0.0257378 7.86741 1)
    hex (36 37 44 43 85 86 93 92) (20 14 1) simpleGrading (1 7.86741 1)
    hex (37 38 45 44 86 87 94 93) (20 14 1) simpleGrading (1 7.86741 1)
    hex (38 39 46 45 87 88 95 94) (42 14 1) simpleGrading (3.14909 7.86741 1)
    hex (39 40 47 46 88 89 96 95) (16 14 1) simpleGrading (3.58238 7.86741 1)
    hex (40 41 48 47 89 90 97 96) (11 14 1) simpleGrading (2.28625 7.86741 1)
    hex (16 17 99 98 65 66 107 106) (20 34 1) simpleGrading (1 0.140637 1)
    hex (17 24 100 99 66 73 108 107) (20 34 1) simpleGrading (1 0.140637 1)
    hex (24 31 101 100 73 80 109 108) (20 34 1) simpleGrading (1 0.140637 1)
    hex (31 30 102 101 80 79 110 109) (20 34 1) simpleGrading (1 0.140637 1)
    hex (30 29 103 102 79 78 111 110) (20 34 1) simpleGrading (1 0.140637 1)
    hex (29 22 104 103 78 71 112 111) (20 34 1) simpleGrading (1 0.140637 1)
    hex (22 15 105 104 71 64 113 112) (20 34 1) simpleGrading (1 0.140637 1)
    hex (15 16 98 105 64 65 106 113) (20 34 1) simpleGrading (1 0.140637 1)
);

edges
(
    arc 98 99 (0.191342 -0.46194 -0.05)
    arc 106 107 (0.191342 -0.46194 0.05)
    arc 99 100 (0.46194 -0.191342 -0.05)
    arc 107 108 (0.46194 -0.191342 0.05)
    arc 100 101 (0.46194 0.191342 -0.05)
    arc 108 109 (0.46194 0.191342 0.05)
    arc 101 102 (0.191342 0.46194 -0.05)
    arc 109 110 (0.191342 0.46194 0.05)
    arc 102 103 (-0.191342 0.46194 -0.05)
    arc 110 111 (-0.191342 0.46194 0.05)
    arc 103 104 (-0.46194 0.191342 -0.05)
    arc 111 112 (-0.46194 0.191342 0.05)
    arc 104 105 (-0.46194 -0.191342 -0.05)
    arc 112 113 (-0.46194 -0.191342 0.05)
    arc 105 98 (-0.191342 -0.46194 -0.05)
    arc 113 106 (-0.191342 -0.46194 0.05)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 7 56 49)
            (7 14 63 56)
            (14 21 70 63)
            (21 28 77 70)
            (28 35 84 77)
            (35 42 91 84)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (6 13 62 55)
            (13 20 69 62)
            (20 27 76 69)
            (27 34 83 76)
            (34 41 90 83)
            (41 48 97 90)
        );
    }
    bottom
    {
        type patch;
        faces
        (
            (0 1 50 49)
            (1 2 51 50)
            (2 3 52 51)
            (3 4 53 52)
            (4 5 54 53)
            (5 6 55 54)
        );
    }
    top
    {
        type patch;
        faces
        (
            (42 43 92 91)
            (43 44 93 92)
            (44 45 94 93)
            (45 46 95 94)
            (46 47 96 95)
            (47 48 97 96)
        );
    }
    obstacle
    {
        type wall;
        faces
        (
            (98 99 107 106)
            (99 100 108 107)
            (100 101 109 108)
            (101 102 110 109)
            (102 103 111 110)
            (103 104 112 111)
            (104 105 113 112)
            (105 98 106 113)
        );
    }
    front
    {
        type empty;
        faces
        (
            (0 1 8 7)
            (1 2 9 8)
            (2 3 10 9)
            (3 4 11 10)
            (4 5 12 11)
            (5 6 13 12)
            (7 8 15 14)
            (8 9 16 15)
            (9 10 17 16)
            (10 11 18 17)
            (11 12 19 18)
            (12 13 20 19)
            (14 15 22 21)
            (17 18 25 24)
            (18 19 26 25)
            (19 20 27 26)
            (21 22 29 28)
            (24 25 32 31)
            (25 26 33 32)
            (26 27 34 33)
            (28 29 36 35)
            (29 30 37 36)
            (30 31 38 37)
            (31 32 39 38)
            (32 33 40 39)
            (33 34 41 40)
            (35 36 43 42)
            (36 37 44 43)
            (37 38 45 44)
            (38 39 46 45)
            (39 40 47 46)
            (40 41 48 47)
            (16 17 99 98)
            (17 24 100 99)
            (24 31 101 100)
            (31 30 102 101)
            (30 29 103 102)
            (29 22 104 103)
            (22 15 105 104)
            (15 16 98 105)
        );
    }
    back
    {
        type empty;
        faces
        (
            (49 50 57 56)
            (50 51 58 57)
            (51 52 59 58)
            (52 53 60 59)
            (53 54 61 60)
            (54 55 62 61)
            (56 57 64 63)
            (57 58 65 64)
            (58 59 66 65)
            (59 60 67 66)
            (60 61 68 67)
            (61 62 69 68)
            (63 64 71 70)
            (66 67 74 73)
            (67 68 75 74)
            (68 69 76 75)
            (70 71 78 77)
            (73 74 81 80)
            (74 75 82 81)
            (75 76 83 82)
            (77 78 85 84)
            (78 79 86 85)
            (79 80 87 86)
            (80 81 88 87)
            (81 82 89 88)
            (82 83 90 89)
            (84 85 92 91)
            (85 86 93 92)
            (86 87 94 93)
            (87 88 95 94)
            (88 89 96 95)
            (89 90 97 96)
            (65 66 107 106)
            (66 73 108 107)
            (73 80 109 108)
            (80 79 110 109)
            (79 78 111 110)
            (78 71 112 111)
            (71 64 113 112)
            (64 65 106 113)
        );
    }
);

mergePatchPairs
(
);